

&AtClient
Procedure Заполнить(Command)
	ЗаполнитьAtServer();
EndProcedure

&AtServer
Procedure ЗаполнитьAtServer()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "SELECT
	|	ТехнологическиеОперацииРаботы.Описание КАК ОписаниеРабот
	|FROM
	|	Catalog.ТехнологическиеОперации.Работы AS ТехнологическиеОперацииРаботы
	|WHERE
	|	ТехнологическиеОперацииРаботы.Ref = &Ref";
	
	Запрос.УстановитьПараметр("Ref", Объект.ТехнологическаяОперация);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.Работы.Загрузить(Результат);
	 
EndProcedure
